app/views/ideas/index.html.erb

    <div id="ideas">
      <% @user = User.find_by_id(my_ideas.idealizer) %>
      <% @votations = my_ideas.votations %>
      <% @comments = my_ideas.idea_comments.count %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ideas".* FROM "ideas"  WHERE "ideas"."idealizer" = ?  [["idealizer", 1]]
SELECT "ideas".* FROM "ideas"