app/views/ideas/show.html.erb

  <% @collaborates.each do |collaborates| %>
    <% @user = User.find_by_id(collaborates.id_user) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]