app/controllers/comments_controller.rb

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment", "lol"], ["created_at", "2014-09-18 13:47:31.007061"], ["updated_at", "2014-09-18 13:47:31.007061"]]
UPDATE "comments" SET "id_idea" = ?, "id_user" = ?, "updated_at" = ? WHERE "comments"."id" = 3  [["id_idea", 1], ["id_user", 1], ["updated_at", "2014-09-18 13:47:31.027431"]]
---
  def create
    if current_user
      @idea = Idea.find params[:id]

      @new_comment = Comment.create(
        params.require(:comment).permit(
          :comment,
          :id_user,
          :id_idea
          )
      )

      @new_comment.id_user = current_user.id
      @new_comment.id_idea = @idea.id

      if @new_comment.save