app/controllers/employees_controller.rb

  def create
    if current_user
      @idea = Idea.find params[:id]
      @new_employeer = Employees.create
      @new_employeer.id_idea = @idea.id
      @new_employeer.id_user = current_user.id
      @new_employeer.approved = false
      @new_employeer.save
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "employees" ("approved", "created_at", "id_idea", "id_user", "updated_at") VALUES (?, ?, ?, ?, ?)  [["approved", "f"], ["created_at", "2014-09-21 11:30:56.369588"], ["id_idea", 1], ["id_user", 1], ["updated_at", "2014-09-21 11:30:56.369588"]]
UPDATE "employees" SET "approved" = ?, "id_idea" = ?, "id_user" = ?, "updated_at" = ? WHERE "employees"."id" = 5  [["approved", "f"], ["id_idea", 1], ["id_user", 1], ["updated_at", "2014-09-21 13:16:56.981941"]]

  def update
    @collaborate = Employees.find params[:id]
    @idea = Idea.find_by_id(@collaborate.id_idea)

    @collaborate.approved = true
    @collaborate.save
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = 1 LIMIT 1
UPDATE "employees" SET "approved" = ?, "updated_at" = ? WHERE "employees"."id" = 1  [["approved", "t"], ["updated_at", "2014-09-21 12:01:01.454399"]]