app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("created_at", "github", "idea", "idealizer", "like", "link", "nlike", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @idea = Idea.new(ideas_params)
    @idea.like = 0
    @idea.nlike = 0
    @idea.idealizer = current_user.id

    if @idea.save

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ideas".* FROM "ideas"  WHERE "ideas"."idealizer" = ?  [["idealizer", 2]]
---
  def show
    @idea = Idea.find params[:id]
    @user = User.find_by_id(@idea.idealizer)

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @idea = Idea.find params[:id]

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "ideas" SET "github" = ?, "updated_at" = ? WHERE "ideas"."id" = 2  [["github", "Editador"], ["updated_at", "2014-09-17 01:54:01.131366"]]
---
  def update
    @idea = Idea.find params[:id]
    @idea.update_attributes(params.require(:idea).permit(:title, :idea, :link, :github))

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "ideas" WHERE "ideas"."id" = 2
---
  def destroy
    @idea = Idea.find params[:id]
    @idea.delete

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment", "Meu comentario fofo :3 2"], ["created_at", "2014-09-18 01:24:15.013516"], ["updated_at", "2014-09-18 01:24:15.013516"]]
UPDATE "comments" SET "id_idea" = ?, "id_user" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["id_idea", 1], ["id_user", 1], ["updated_at", "2014-09-18 01:24:15.414719"]]
---
  def new_comment
    if current_user
      @idea = Idea.find params[:id]
      @new_comment = Comment.create(params.require(:comment).permit(:comment, :id_user, :id_idea))
      @new_comment.id_user = current_user.id
      @new_comment.id_idea = @idea.id

      if @new_comment.save