app/controllers/login_controller.rb

  def create
    user = User.find_by_email(params[:login][:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'leofrederiche@gmail.com' LIMIT 1