app/controllers/user_controller.rb

	def create
		@user = User.new(users_params)

		if @user.save
---
INSERT INTO "users" ("cover_content_type", "cover_file_name", "cover_file_size", "cover_updated_at", "created_at", "email", "like", "name", "nlike", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@user = User.find_by_id(current_user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@user = User.find_by_id(current_user.id)

		@user.update_attributes(
			params.require(:user).permit(
				:name,
				:email,
				:password,
				:password_confirmation,
				:cover,
				:web,
				:facebook,
				:acquiriments,
				:description
				)
		)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$WUOKo3KjKq1/c1CjdCnf8e3tIpRaGVs2IxKXQyvDN73IgZ4jemSPi"], ["updated_at", "2014-09-14 13:45:09.095608"]]