app/controllers/votations_controller.rb

  def create_like
    if current_user
      @idea = Idea.find params[:id]
      @votations_idea = @idea.votations

      @votations_idea.each do |votations|
        @status = votations if votations.id_user == current_user.id
      end

      if @status
        @status.votation = true
        @status.save
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-09-21 00:50:20.031443"], ["updated_at", "2014-09-21 00:50:20.031443"]]
UPDATE "votations" SET "id_idea" = ?, "id_user" = ?, "updated_at" = ?, "votation" = ? WHERE "votations"."id" = 1  [["id_idea", 1], ["id_user", 1], ["updated_at", "2014-09-21 00:50:20.114653"], ["votation", "t"]]

  def create_nlike
    if current_user
      @idea = Idea.find params[:id]
      @votations_idea = @idea.votations

      @votations_idea.each do |votations|
        @status = votations if votations.id_user == current_user.id
      end

      if @status
        @status.votation = false
        @status.save
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votations" ("created_at", "id_idea", "id_user", "updated_at", "votation") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-21 01:25:56.029174"], ["id_idea", 2], ["id_user", 1], ["updated_at", "2014-09-21 01:25:56.029174"], ["votation", "f"]]
UPDATE "votations" SET "updated_at" = ?, "votation" = ? WHERE "votations"."id" = 1  [["updated_at", "2014-09-21 01:25:05.778166"], ["votation", "f"]]