app/controllers/welcome_controller.rb

	def index
		@all_user = User.all
---
SELECT "users".* FROM "users"